# Домашнее задание №2

В этом домашнем задании нам нужно закрепить основы SQL.

Отправить ДЗ можно на почту tixons.work@gmail.com

Для этого необходимо выставить уровень доступа на комментирование (share -> Get shareable link -> anyone with that link can comment)
и отправить мне полученную ссылку. Кроме этого нужно приложить файл .ipynb с вашим решением. Желательно отправить и ссылку на ваш гит с решениями.

Кроме задачек представленных в ноутбуке надо прислать скрин успешного выполнения первых 15 задачек на sql-ex

Сроки выполнения:

* мягкий дедлайн 05.04.2021
* жесткий дедлайн 12.04.2021

Мягкий дедлайн предполагает отправку обратной связи и комментарии по выполнению.
После жесткого дедлайна задания не принимаются.

В решении можно ориентироваться на модельный вывод, представленный в описании

In [ ]:
# установить библиотеку для подключения
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/de/f7/b783b60a3bd8aea348990c60fb0b3ed2f843c6f40ad29e37a89a5d50d7a3/mysql_connector_python-8.0.23-cp37-cp37m-manylinux1_x86_64.whl (18.0MB)
     |████████████████████████████████| 18.1MB 243kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (54.1.2)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.23

X в объекте подключения заменить на свой номер в [таблице](https://docs.google.com/spreadsheets/d/1fXwpSiPKJxuUPy9P47XCKO8cvpvHa09jd6qLKKzyd_w/edit?usp=sharing)

In [ ]:
!pip install mysql-connector-python
!pip install SQLAlchemy
from sqlalchemy import create_engine

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.7/dist-packages (8.0.23)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (54.1.2)
Requirement already satisfied: SQLAlchemy in /usr/local/lib/python3.7/dist-packages (1.3.23)

In [ ]:
# создаем объект подключения, 
sql = create_engine('mysql+mysqlconnector://user_4:user4password@167.172.97.202/db_user_4', pool_recycle=60)
connection = sql.connect()
# отправка комманд без чтения/записи (например удаление) в самом конце

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

# Ваше задание

Работаем с БД с урока:

<img src="https://sp.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" alt="drawing" width="400"/>

Задача №1 (1 балл)

Найти номер клиента и количество его заказов (таблица orders) по убыванию 

Подсказка: 

Order by название_столбца_по_которому_убываем desc;

In [ ]:
df = pd.read_sql("""
Select 
    distinct customerNumber, count(orderNumber) as ct_orders 
from 
    orders 
group by customerNumber 
order by count(orderNumber) desc
""", connection)
df

    customerNumber  ct_orders
0              141         26
1              124         17
2              323          5
3              145          5
4              148          5
..             ...        ...
93             177          2
94             239          2
95             319          2
96             240          2
97             415          1

[98 rows x 2 columns]

Задача №2 (2 балла)

Создать запрос с полями и вывести первые 10 значений

Название колонки | Источник иформации
--- | ---
Работник | конкатенация колонок firstName lastName таблицы employees
Почта | столбец email таблицы employees
Название работы | столбец job title таблицы employees
Адрес работы |  конкатенация колонок postalCode, addressLine1, state, country таблицы offices
Телефон офиса |  столбец phone таблицы offices

In [ ]:
df = pd.read_sql("""
Select 
    distinct
    concat(emp.firstName,' ',emp.lastName)  as 'Работник',
    emp.email as 'Почта',
    emp.jobTitle as 'Название работы',
    concat(off.postalCode,', ',off.addressLine1,' ',off.state,' ',off.country) as 'Адрес работы',
    off.phone as 'Телефон офиса'
from 
    employees emp
    join offices off on emp.officeCode = off.officeCode
""", connection)
df.head(10)

          Работник  ...    Телефон офиса
0     Diane Murphy  ...  +1 650 219 4782
1   Mary Patterson  ...  +1 650 219 4782
2    Jeff Firrelli  ...  +1 650 219 4782
3      Anthony Bow  ...  +1 650 219 4782
4  Leslie Jennings  ...  +1 650 219 4782
5  Leslie Thompson  ...  +1 650 219 4782
6   Julie Firrelli  ...  +1 215 837 0825
7  Steve Patterson  ...  +1 215 837 0825
8   Foon Yue Tseng  ...  +1 212 555 3000
9    George Vanauf  ...  +1 212 555 3000

[10 rows x 5 columns]

Задача № 3 (2 балла)

Отобразить название продукта и текстовое описание продуктовой линии (таблицы products и productlines)

In [ ]:
df = pd.read_sql("""
Select 
    distinct
    pd.productName as 'Название продукта',
    pl.textDescription as 'Описание продуктовой линии'
from 
    products pd
    join productlines pl on pl.productLine = pd.productLine
""", connection)
df

                    Название продукта                         Описание продуктовой линии
0            1952 Alpine Renault 1300  Attention car enthusiasts: Make your wildest c...
1                 1972 Alfa Romeo GTA  Attention car enthusiasts: Make your wildest c...
2              1962 LanciaA Delta 16V  Attention car enthusiasts: Make your wildest c...
3                   1968 Ford Mustang  Attention car enthusiasts: Make your wildest c...
4                   2001 Ferrari Enzo  Attention car enthusiasts: Make your wildest c...
..                                ...                                                ...
105          1940 Ford Delivery Sedan  Our Vintage Car models realistically portray a...
106  1936 Mercedes Benz 500k Roadster  Our Vintage Car models realistically portray a...
107             1936 Chrysler Airflow  Our Vintage Car models realistically portray a...
108          1928 Ford Phaeton Deluxe  Our Vintage Car models realistically portray a...
109      1930 Buick Marquette Phaeton  Our Vintage Car models realistically portray a...

[110 rows x 2 columns]

Задача № 4 (2 балла)

Создать запрос с полями:

Название колонки | Источник иформации
--- | ---
Номер заказа | столбец orderNumber таблицы orders
Номер клиента | столбец customerNumber таблицы orders
Требуемая дата доставки | столбец requiredDate таблицы orders
Дата доставки | столбец shippedDate таблицы orders
Статус доставки | столбец status таблицы orders
Кредитный лимит | столбец creditLimit таблицы customers
Сумма оплаты | столбец amount таблицы payments
Дата совершения оплаты | столбец paymentDate таблицы payments

Отобразить первые 10 строк.

Примечание:

Результаты запроса SELECT можно сохранить для последющего использования

`
    SELECT
        my_select.some_column
    FROM
    (SELECT ...) as my_select
`

In [ ]:
df = pd.read_sql("""
Select 
    os.orderNumber as 'Номер заказа',
    os.customerNumber as 'Номер клиента',
    os.requiredDate as 'Требуемая дата доставки',
    os.shippedDate as 'Дата доставки',
    os.status as 'Статус доставки',
    cs.creditLimit as 'Кредитный лимит',
    ps.amount as 'Сумма оплаты',
    ps.paymentDate as 'Дата совершения оплаты'
from 
    orders os
    join customers cs on cs.customerNumber = os.customerNumber
    join payments ps on ps.customerNumber = cs.customerNumber
""", connection)
df.head(10)

   Номер заказа  Номер клиента  ... Сумма оплаты Дата совершения оплаты
0         10100            363  ...     50799.69             2004-11-17
1         10100            363  ...     10223.83             2003-01-16
2         10100            363  ...     55425.77             2003-12-05
3         10101            128  ...     10549.01             2003-01-28
4         10101            128  ...     24101.81             2003-10-18
5         10101            128  ...     33820.62             2004-03-24
6         10101            128  ...      7466.32             2004-11-18
7         10102            181  ...     22602.36             2004-04-25
8         10102            181  ...      5494.78             2003-01-30
9         10102            181  ...     44400.50             2004-11-16

[10 rows x 8 columns]

Задача № 5 (3 балла)

Создать представление с полями:

Название колонки | Источник иформации
--- | ---
Номер заказа | столбец orderNumber таблицы orders
Название продукта | столбец productName таблицы products
Код продукта | столбец productCode таблицы products
Количество заказов | столбец quantityOrdered таблицы orderdetails
Цена за один | столбец priceEach таблицы orderdetails
Цена покупки | столбец buyPrice таблицы products
Итоговая сумма | результат перемножения цены покупки * кол-во заказанных
Прибыль | результат перемножения (закупочной цены (buy Price из products) минус цена покупки) * кол-во заказанных
Заказчик | столбец customerName таблицы customers
Имя представителя | конкатенация столбцев contactLastName и contactFirstName таблицы customers
адрес | столбец addressLine1 таблицы customers


Отобразить результат вызова представления

Из полученного представления найти заказчиков и принесенную прибыль, (отсортировать по убыванию суммарной прибыли по всем), отобразить.
Учитывайте, что заказ должен быть доставлен! Shipped = True

In [ ]:
connection.execute('''
CREATE OR REPLACE VIEW ords as
Select 
    os.orderNumber as 'Номер заказа',
    ps.productName as 'Название продукта',
    ps.productCode as 'Код продукта',
    od.quantityOrdered as 'Количество заказов',
    od.priceEach as 'Цена за один',
    ps.buyPrice as 'Цена покупки',
    od.priceEach*od.quantityOrdered as 'Итоговая сумма',
    (od.priceEach - ps.buyPrice)*od.quantityOrdered as 'Прибыль',
    cs.customerName as 'Заказчик',
    concat(cs.contactLastName,' ',contactFirstName) as 'Имя представителя',
    cs.addressLine1 as 'Адрес'
from 
    orders os
    join orderdetails od on od.orderNumber = os.orderNumber
    join customers cs on cs.customerNumber = os.customerNumber
    join products ps on ps.productCode = od.productCode
where
    os.status = 'Shipped'
order by os.orderNumber;
''')

# отправим запрос на подтверждение результата
df = pd.read_sql('''
SELECT * from ords''', connection)
df.head(10)

   Номер заказа  ...                     Адрес
0         10100  ...  2304 Long Airport Avenue
1         10100  ...  2304 Long Airport Avenue
2         10100  ...  2304 Long Airport Avenue
3         10100  ...  2304 Long Airport Avenue
4         10101  ...             Lyonerstr. 34
5         10101  ...             Lyonerstr. 34
6         10101  ...             Lyonerstr. 34
7         10101  ...             Lyonerstr. 34
8         10102  ...         2678 Kingston Rd.
9         10102  ...         2678 Kingston Rd.

[10 rows x 11 columns]

Из полученного представления найти заказчиков и принесенную прибыль, (отсортировать по убыванию суммарной прибыли по всем)

In [ ]:
df = pd.read_sql('''
SELECT 
    ords.Заказчик, sum(ords.Прибыль) as 'Прибыль'
from ords
group by ords.Заказчик
order by sum(ords.Прибыль) desc''', connection)
df

                        Заказчик    Прибыль
0         Euro+ Shopping Channel  263439.51
1   Mini Gifts Distributors Ltd.  232494.29
2             Muscle Machine Inc   72370.09
3     Australian Collectors, Co.   70311.07
4        Dragon Souveniers, Ltd.   60477.38
..                           ...        ...
93             Atelier graphique   10063.80
94            Frau da Collezione    9532.93
95               Mini Auto Werke    8473.59
96       Auto-Moto Classics Inc.    6586.02
97             Boards & Toys Co.    2610.87

[98 rows x 2 columns]